2Dnozzle_short_final/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0.0001 0);

boundaryField
{
    inlet
    {
        type            inletOutlet;
	inletValue      uniform (0 0 0); 
	value 		uniform (0 0 0);
    }    

    outlet
    {
        type            inletOutlet;
	inletValue      uniform (0 0 0); 
	value 		uniform (0 0 0);
    }

    wall
    {
        type            noSlip;
    }
    frontAndBackPlanes
    {
        type            empty;
    }

    
}
// ************************************************************************* //
